#### Creating Dataframes

In [134]:
#Read CSV files into Jupyter notebook
import pandas as pd
df=pd.read_csv('class.csv')
df

       Name Sex  Age  Height  Weight
0    Alfred   M   14    69.0   112.5
1     Alice   F   13    56.5    84.0
2   Barbara   F   13    65.3    98.0
3     Carol   F   14    62.8   102.5
4     Henry   M   14    63.5   102.5
5     James   M   12    57.3    83.0
6      Jane   F   12    59.8    84.5
7     Janet   F   15    62.5   112.5
8   Jeffrey   M   13    62.5    84.0
9      John   M   12    59.0    99.5
10    Joyce   F   11    51.3    50.5
11     Judy   F   14    64.3    90.0
12   Louise   F   12    56.3    77.0
13     Mary   F   15    66.5   112.0
14   Philip   M   16    72.0   150.0
15   Robert   M   12    64.8   128.0
16   Ronald   M   15    67.0   133.0
17   Thomas   M   11    57.5    85.0
18  William   M   15    66.5   112.0

In [36]:
#Obtaing Mean and other statistical features of a column
df['Weight'].max()
df['Weight'].mean()

100.02631578947368

In [135]:
#Selecting Rows and filtering with condition from dataframe
df[['Name','Age']][df['Sex']=='M'][df['Age']==12]

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

      Name  Age
5    James   12
9     John   12
15  Robert   12

In [74]:
# Creating a Dataframe
weather_data=[['1/1/2017',32,6,'Rain'],
             ['1/1/2017',30,6,'Rain'],
             ['1/1/2017',27,6,'Rain'],
             ['1/1/2017',25,6,'Rain'],
             ['1/1/2017',20,6,'Rain']]
df=pd.DataFrame(weather_data,columns=['day','temparature','windspeed','event'])
df

        day  temparature  windspeed event
0  1/1/2017           32          6  Rain
1  1/1/2017           30          6  Rain
2  1/1/2017           27          6  Rain
3  1/1/2017           25          6  Rain
4  1/1/2017           20          6  Rain

In [56]:
df.shape

(5, 4)

In [58]:
df.head()
df.tail()

        day  temparature  windspeed event
0  1/1/2017           32          6  Rain
1  1/1/2017           32          6  Rain
2  1/1/2017           32          6  Rain
3  1/1/2017           32          6  Rain
4  1/1/2017           32          6  Rain

In [61]:
df[0:3]

        day  temparature  windspeed event
0  1/1/2017           32          6  Rain
1  1/1/2017           32          6  Rain
2  1/1/2017           32          6  Rain

In [62]:
df.columns

Index(['day', 'temparature', 'windspeed', 'event'], dtype='object')

In [68]:
df.day
df['day']
df[['day','temparature']]

        day  temparature
0  1/1/2017           32
1  1/1/2017           32
2  1/1/2017           32
3  1/1/2017           32
4  1/1/2017           32

In [71]:
df.temparature
df['temparature'].max()
df['temparature'].mean()
df['temparature'].min()

32

In [72]:
df['temparature'].describe()

count     5.0
mean     32.0
std       0.0
min      32.0
25%      32.0
50%      32.0
75%      32.0
max      32.0
Name: temparature, dtype: float64

In [76]:
df[df['temparature']==df['temparature'].max()]

        day  temparature  windspeed event
0  1/1/2017           32          6  Rain

In [77]:
df.day[df['temparature']==df['temparature'].max()]

0    1/1/2017
Name: day, dtype: object

In [79]:
#DF to csv excluding index
df.to_csv('To_csv.csv')
df.to_csv('To_csv.csv',index=False)

In [85]:
#Groupby Age
import pandas as pd
df=pd.read_csv('class.csv')
g=df.groupby('Age')
g

In [86]:
for Age,Age_g in g:
    print(Age)
    print(Age_g)

11
      Name Sex  Age  Height  Weight
10   Joyce   F   11    51.3    50.5
17  Thomas   M   11    57.5    85.0
12
      Name Sex  Age  Height  Weight
5    James   M   12    57.3    83.0
6     Jane   F   12    59.8    84.5
9     John   M   12    59.0    99.5
12  Louise   F   12    56.3    77.0
15  Robert   M   12    64.8   128.0
13
      Name Sex  Age  Height  Weight
1    Alice   F   13    56.5    84.0
2  Barbara   F   13    65.3    98.0
8  Jeffrey   M   13    62.5    84.0
14
      Name Sex  Age  Height  Weight
0   Alfred   M   14    69.0   112.5
3    Carol   F   14    62.8   102.5
4    Henry   M   14    63.5   102.5
11    Judy   F   14    64.3    90.0
15
       Name Sex  Age  Height  Weight
7     Janet   F   15    62.5   112.5
13     Mary   F   15    66.5   112.0
16   Ronald   M   15    67.0   133.0
18  William   M   15    66.5   112.0
16
      Name Sex  Age  Height  Weight
14  Philip   M   16    72.0   150.0

In [94]:
g.get_group(15)

       Name Sex  Age  Height  Weight
7     Janet   F   15    62.5   112.5
13     Mary   F   15    66.5   112.0
16   Ronald   M   15    67.0   133.0
18  William   M   15    66.5   112.0

In [95]:
print(g.max())

        Name Sex  Height  Weight
Age
11    Thomas   M    57.5    85.0
12    Robert   M    64.8   128.0
13   Jeffrey   M    65.3    98.0
14      Judy   M    69.0   112.5
15   William   M    67.0   133.0
16    Philip   M    72.0   150.0

In [96]:
print(g.mean())

        Height      Weight
Age
11   54.400000   67.750000
12   59.440000   94.400000
13   61.433333   88.666667
14   64.900000  101.875000
15   65.625000  117.375000
16   72.000000  150.000000

In [97]:
print(g.describe())

    Height                                                        Weight  \
     count       mean       std   min     25%   50%     75%   max  count
Age
11     2.0  54.400000  4.384062  51.3  52.850  54.4  55.950  57.5    2.0
12     5.0  59.440000  3.297423  56.3  57.300  59.0  59.800  64.8    5.0
13     3.0  61.433333  4.495924  56.5  59.500  62.5  63.900  65.3    3.0
14     4.0  64.900000  2.801190  62.8  63.325  63.9  65.475  69.0    4.0
15     4.0  65.625000  2.096624  62.5  65.500  66.5  66.625  67.0    4.0
16     1.0  72.000000       NaN  72.0  72.000  72.0  72.000  72.0    1.0


           mean        std    min      25%     50%      75%    max
Age
11    67.750000  24.395184   50.5   59.125   67.75   76.375   85.0
12    94.400000  20.528639   77.0   83.000   84.50   99.500  128.0
13    88.666667   8.082904   84.0   84.000   84.00   91.000   98.0
14   101.875000   9.213893   90.0   99.375  102.50  105.000  112.5
15   117.375000  10.419333  112.0  112.000  112.25  117.625  133.0
16   150.000000        NaN  150.0  150.000  150.00  150.000  150.0

In [136]:
#Creating Dataframe1
india_weather=pd.DataFrame({'City':['mumbai','delhi','bangalore'],'temp':[32,45,30],'humidity':[80,60,45]})
india_weather

        City  temp  humidity
0     mumbai    32        80
1      delhi    45        60
2  bangalore    30        45

In [137]:
#Creating Dataframe2
india_weather1=pd.DataFrame({'City':['delhi','bangalore','JK'],'temp':[32,45,30],'humidity1':[80,60,45]})
india_weather1

        City  temp  humidity1
0      delhi    32         80
1  bangalore    45         60
2         JK    30         45

In [139]:
#Concat Vertically
df=pd.concat([india_weather,india_weather1],ignore_index=True)
df

        City  temp  humidity  humidity1
0     mumbai    32      80.0        NaN
1      delhi    45      60.0        NaN
2  bangalore    30      45.0        NaN
3      delhi    32       NaN       80.0
4  bangalore    45       NaN       60.0
5         JK    30       NaN       45.0

In [117]:
#Concat Horizontally
df=pd.concat([india_weather,india_weather1],axis=1)
df

        City  temp  humidity       City  temp  humidity1
0     mumbai    32        80      delhi    32         80
1      delhi    45        60  bangalore    45         60
2  bangalore    30        45         JK    30         45

In [118]:
#Merge with left join
df=pd.merge(india_weather,india_weather1,on='City')
df

        City  temp_x  humidity  temp_y  humidity1
0      delhi      45        60      32         80
1  bangalore      30        45      45         60

In [119]:
#Merge with Outer-Join
df=pd.merge(india_weather,india_weather1,on='City',how='outer')
df

        City  temp_x  humidity  temp_y  humidity1
0     mumbai    32.0      80.0     NaN        NaN
1      delhi    45.0      60.0    32.0       80.0
2  bangalore    30.0      45.0    45.0       60.0
3         JK     NaN       NaN    30.0       45.0

In [120]:
#Creating dataframes with Index
df=pd.DataFrame([1,2,3,4,5,6],index=[49,48,36,35,10,11])
df

    0
49  1
48  2
36  3
35  4
10  5
11  6

In [129]:
#Row access usinf the index
df.loc[36]

0    3
Name: 36, dtype: int64

In [130]:
#Row access using the row number
df.iloc[1]

0    2
Name: 48, dtype: int64